{"BadBMBF":["v1.13.2","v1.13.1"],"ADBPaths":["adb.exe","User\\Android\\platform-tools_r29.0.4-windows\\platform-tools\\adb.exe","User\\AppData\\Roaming\\SideQuest\\platform-tools\\adb.exe"],"Updates":[{"Major":"1","Minor":"8","Patch":"3","Creators":["ComputerElite"],"Changelog":"I fixed a little bug that would crash BMBF Manager if a mod is only on Questboards","Download":"https://github.com/ComputerElite/BM/releases/download/1.8.3/BM.zip"},{"Major":"1","Minor":"8","Patch":"2","Creators":["ComputerElite"],"Changelog":"You can now see if you have a mod installed. it's a bit more like mod assistant for PCVR.","Download":"https://github.com/ComputerElite/BM/releases/download/1.8.2/BM.zip"},{"Major":"1","Minor":"8","Patch":"1","Creators":["ComputerElite"],"Changelog":"You can now update all your mods with one click.","Download":"https://github.com/ComputerElite/BM/releases/download/1.8.1/BM.zip"},{"Major":"1","Minor":"8","Patch":"0","Creators":["ComputerElite"],"Changelog":"QSU HAS BEEN INTEGRATED INTO BMBF MANAGER. I added the beatsaver custom protocol to use one click install on beatsaver. Keep alive added (wakes the Quest from standby every 15 sec. Helpful for Quest 2 Users). Code Cleanup. Also I added 4 solid color Background to the zip (got requested). This Build has only been extensively tested by me","Download":"https://github.com/ComputerElite/BM/releases/download/1.8.0/BM.zip"},{"Major":"1","Minor":"7","Patch":"4","Creators":["ComputerElite"],"Changelog":"I fixed adb and rewrote the entire function. you can now disable adb windows (that's by default). It shouldn't freeze anymore while installing/updateing BMBF. Code cleanup af. ADB paths are now in update.json and not hardcoded. First build that got some testing by someone else in a long time (just Quest 1).","Download":"https://github.com/ComputerElite/BM/releases/download/1.7.4/BM.zip"},{"Major":"1","Minor":"7","Patch":"3","Creators":["ComputerElite"],"Changelog":"Since many people had problems with BMBF version 1.13.2 and 1.13.1 (including me) I added the ability to not recommend certain versions of BMBF. you can still install the newest one even if it isn't recommended. I also changed that error adb100 also pops up if your Quest isn't connected to your PC","Download":"https://github.com/ComputerElite/BM/releases/download/1.7.3/BM.zip"},{"Major":"1","Minor":"7","Patch":"2","Creators":["ComputerElite"],"Changelog":"You can now import all your old Backups made by BBBU. Also added that button to the settings menu in case you need it. I also added some dlls back in after removing Newtonsoft.json","Download":"https://github.com/ComputerElite/BM/releases/download/1.7.2/BM.zip"},{"Major":"1","Minor":"7","Patch":"1","Creators":["ComputerElite"],"Changelog":"I still used the very first version of my Update progress for BMBF manager. Now I finally Updated it with all my new knowledge. I changed to JSON so other programs can use that information too. This also opens the functionality as archieve.","Download":"https://github.com/ComputerElite/BM/releases/download/1.7.1/BM.zip"},{"Major":"1","Minor":"7","Patch":"0","Creators":["ComputerElite"],"Changelog":"I made more checks when opening BMBF. You can now switch game Version e. g. 1.13 to 1.12 (Backup Requiered). This has only been testen on Quest 1","Download":"https://github.com/ComputerElite/BM/releases/download/1.7/BM.zip"}]}
